<a href="https://colab.research.google.com/github/mlukan/GDA3B2021/blob/main/Martin_Lukan_Pandas_Part_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mission 1

Display the following information for this dataset: http://bit.ly/movieusers
- The last 5 rows
- The first 5 rows
- The type of each column

Note : start coding something by typing `pd.read...` and explore the different options available, especially the `sep` parameter.

In [8]:
import pandas as pd
import urllib
#f = urllib. request. urlopen('http://bit.ly/movieusers')
#print(f.readlines()[:9])
moviedf =pd.read_csv('http://bit.ly/movieusers', sep='|')
moviedf.head()
moviedf.tail()
moviedf.dtypes

1              int64
24             int64
M             object
technician    object
85711         object
dtype: object

# Mission 2

Display the first 10 rows in the following file: http://bit.ly/drinksbycountry

In [10]:

drinksdf = pd.read_csv('http://bit.ly/drinksbycountry', sep=',')
drinksdf.head(10)

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
2            Algeria  ...         Africa
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America
6          Argentina  ...  South America
7            Armenia  ...         Europe
8          Australia  ...        Oceania
9            Austria  ...         Europe

[10 rows x 6 columns]

Set the "country" column as the index for the dataframe.

In [15]:
drinksdf = drinksdf.set_index('country')

# Mission 3

Access the values of the row for **Zimbabwe** (use the index value)

In [17]:
drinksdf.loc["Zimbabwe",:]

beer_servings                       64
spirit_servings                     18
wine_servings                        4
total_litres_of_pure_alcohol       4.7
continent                       Africa
Name: Zimbabwe, dtype: object

# Mision 4

Display only the "continent" column value for the country **Zimbabwe**.

In [18]:
drinksdf.loc['Zimbabwe','continent']

'Africa'

# Mission 5

Rename the columns of this dataset: http://bit.ly/uforeports, try using the following 2 different methods to achieve this:
- Setting column names directly when reading the file 
- Editing after creating the dataframe ([This resource could be useful](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html))

In [34]:
# Setting column names directly when reading the file
portsdf = pd.read_csv('http://bit.ly/uforeports',sep=',', names=['city','color','shape','state','timestamp'],header=0)
portsdf

                       city color     shape state         timestamp
0                    Ithaca   NaN  TRIANGLE    NY    6/1/1930 22:00
1               Willingboro   NaN     OTHER    NJ   6/30/1930 20:00
2                   Holyoke   NaN      OVAL    CO   2/15/1931 14:00
3                   Abilene   NaN      DISK    KS    6/1/1931 13:00
4      New York Worlds Fair   NaN     LIGHT    NY   4/18/1933 19:00
...                     ...   ...       ...   ...               ...
18236            Grant Park   NaN  TRIANGLE    IL  12/31/2000 23:00
18237           Spirit Lake   NaN      DISK    IA  12/31/2000 23:00
18238           Eagle River   NaN       NaN    WI  12/31/2000 23:45
18239           Eagle River   RED     LIGHT    WI  12/31/2000 23:45
18240                  Ybor   NaN      OVAL    FL  12/31/2000 23:59

[18241 rows x 5 columns]

In [ ]:
# Editing after creating the dataframe
portsdf = pd.read_csv('http://bit.ly/uforeports',sep=',')
portsdf.columns=['city','color','shape','state','timestamp']
portsdf

# Mission 6

Select the first 3 rows and all the columns of the dataframe using iloc

In [21]:
portsdf.iloc[:3,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

# Mission 7

Achieve the same result as in mission 6 by using loc

In [23]:
portsdf.loc[:2,:]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00